import streamlit as st
from datetime import datetime, timedelta
st.set_page_config(
    page_title="శ్రీ రామచంద్ర పరబ్రహ్మణే నమః",
    page_icon="🚩",
    layout="centered",
    initial_sidebar_state="auto",
)

hide_streamlit_style = """
<style>
    #root > div:nth-child(1) > div > div > div > div > section > div {padding-top: 3rem;}
</style>

"""
st.markdown(hide_streamlit_style, unsafe_allow_html=True)
st.markdown("<h1 style='text-align: center; color: #15d888;'>జై శ్రీ రామ్ 🚩</h1>", unsafe_allow_html=True)

end_date = datetime(2024, 1, 22)
time_remaining = end_date - datetime.now()
days_remaining = time_remaining.days
hours_remaining = time_remaining.seconds // 3600
minutes_remaining = (time_remaining.seconds // 60) % 60
seconds_remaining = time_remaining.seconds % 60
#st.markdown(f"<h2 style='text-align: center;'> Days {days_remaining} , Hours {hours_remaining},  Minutes {minutes_remaining}, Seconds {seconds_remaining}</h2> ", unsafe_allow_html=True)
# instead of markdown display using streamlit widgets for timer
st.toast(f"{days_remaining} Days {hours_remaining} Hours {minutes_remaining} Minutes {seconds_remaining} Seconds to go 😍")

ramakoti_tab, songs_tab, gallery_tab,= st.tabs(["శ్రీ రామకోటి [లక్ష నామల లిఖిత జపం]", "శ్రీ రామచంద్రుడి పాటలు", "అయోధ్య ఫోటోలు"])
# with video_tab:
#     st.subheader("Ram Mandir Live Video / "అయోధ్య రామమందిరం లైవ్ వీడియో"", divider="rainbow")
#     st.info("Log back on 22 January 2024 for the live video :) ")
with gallery_tab:
    st.info("We are collecting Photos for you :) ")
with songs_tab:
    with st.expander("హరే కృష్ణ మంత్రం"):
        st.write("హరే కృష్ణ హరే కృష్ణ\n"
                 "\nకృష్ణ కృష్ణ హరే హరే ||\n"
                 "\nహరే రామ హరే రామ\n"
                 "\nరామ రామ హరే హరే ||")
    with st.expander("హరే కృష్ణ మంత్రం English"):
        st.write("Hare Krishna Hare Krishna, Krishna Krishna Hare Hare\n"
                 "\nHare Rama Hare Rama , Rama Rama Hare Hare")
    with st.expander("హరే కృష్ణ మంత్రం हिंदी"):
        st.write("हरे कृष्ण हरे कृष्ण\n"
                 "\nकृष्ण कृष्ण हरे हरे ||\n"
                 "\nहरे राम हरे राम\n"
                 "\nराम राम हरे हरे ||")
    with st.expander("పలికినంత పుణ్యమే శ్రీ రామ నామము"):
        st.write('''
        **సాకి...**
        
        దాశరథి కరుణాపయోనిధీ...... వినరా....మొరా..... రఘువంశ రాఘవా...


        **పల్లవి...** 

        పలికినంత పుణ్యమే శ్రీ రామ నామము 

        రాఘవ మమ్ము కావాలా.. రాఘవ మమ్ము బ్రోవరా


        **చరణం...** 

        కఠినమైన బోయవాన్ని పరమాత్మగ చేసిన 

        వాల్మికికి ప్రియమైనది శ్రీరామ నామము 

        దైవమే తన వెంగిలి ఫలములు తిన్నాడని 

        శబరికెంతొ ప్రయమైనది శ్రీరామ నామము

 

        ||పలికి||


        **చరణం....** 

        బందికాన జీవితాన బరువును నిలిపేవని 

        భక్త రామదాసుని నిక్కమైన నామము 

        అణువులోన తనువులోన నిలువెల్ల నీవేనని 

        గుండె చీల్చి చూపిన హనుమలోని నామం 
        
        ||పలికి||

        **చరణం...** 

        కలుశాత్ముడు రావణుని ఎదురొడ్డి నిలిచిన 

        జరాయువుకు ప్రయమైనది శ్రీరామ నామము 

        యజ్ఞ యాగాదులందు రాక్షసులు పగ బూనగ 

        మునివర్యులు పలికినది శ్రీరామ నామము
        ''')
    with st.expander("అయోధ్యలో వీరబూసేనే కదా ఆ నాటి రామ కథ"):
        st.write('''
        అయోధ్యలో వీరబూసేనే కదా ఆ నాటి రామ కథ నే మరువలేను కదా

        ఆ… ఆ… ఆ…  నే మరువలేను కదా

        దశరథ పుత్రుడవయ్యా అయోధ్య రామయ్యా
        
        తండ్రి ఆనతి కోరకు అడవులక్ వేగవయ్య

        **||అయోధ్యలో ||**

        నీ నామం వినరాగానే నీ గుడి కి చేరమయ్యా
        
        భక్తులను బ్రోవగా రావ భద్రాద్రి రామయ్యా

        **||అయోధ్యలో ||**

        ప్రతి గుడి కి నీవు తిరిగి ఏ గుడి నీసరి లేక
        
        భద్రాచలము నందు స్థిరముగా వెలసితివయ్యా

        **||అయోధ్యలో ||**
        
        అనుదినము నీదు భజన ఆనందముగా చేసె
        
        ఆప్తులను బ్రోవగా రావా అయోధ్య రామయ్యా

        **||అయోధ్యలో ||**
        ''')
    with st.expander("నా మనోహర రామ చంద్రా నాదు కోర్కెలు తీర్చుమా"):
        st.write('''
        నా మనోహర రామ చంద్రా నాదు కోర్కెలు తీర్చుమా || 2 || 

        పరన శాలకు వచ్చెను బంగారు లేడిని చూడుమా || 2 || 

        నా మనోహర రామ చంద్రా నాదు కోర్కెలు తీర్చుమా || 2 || 

        పరన శాలకు వచ్చెను బంగారు లేడిని చూడుమా || 2 || 

        **నా మనోహర రామ చంద్రా...**

 
        అదిగో చూడుము ప్రాణ నాథ బెదరకనే యున్నది || 2 || 

        పరుగులెత్తుచు పరన శాల చుట్టు తిరుగూ చున్నదీ || 2 || 

        నా మనోహర రామ చంద్రా నాదు కోర్కెలు తీర్చుమా || 2 || 

        పరన శాలకు వచ్చెను బంగారు లేడిని చూడుమా || 2 || 

        **నా మనోహర రామ చంద్రా....**

 
        సుందరంగా దాని కన్నులు చుక్కలునుగా పోలును || 2 || 

        చెవులు శృంగారంబులు దాని కొమ్ములే విల నంబులు || 2 || 

        నా మనోహర రామ చంద్రా నాదు కోర్కెలు తీర్చుమా || 2 || 

        పరన శాలకు వచ్చెను బంగారు లేడిని చూడుమా || 2 || 

        **నా మనోహర రామ చంద్రా....**

 
        ప్రాణనాథా దాని దేహము పంచ రంగుల ఛాయలూ || 2 || 

        మించి యున్నది దాని రూపము గంతులేయుచున్నదీ || 2 || 

        నా మనోహర రామ చంద్రా నాదు కోర్కెలు తీర్చుమా || 2 || 

        పరన శాలకు వచ్చెను బంగారు లేడిని చూడుమా || 2 || 

        **నా మనోహర రామ చంద్రా....**
 

        పదిలముగ బంగారు లేడిని పట్టి తెమ్ము మనోహరా || 2 || 

        చిక్క కుండిన దాని చర్మము చీల్చి తెమ్ము మనోహరా || 2 || 

        నా మనోహర రామ చంద్రా నాదు కోర్కెలు తీర్చుమా || 2 || 

        పరన శాలకు వచ్చెను బంగారు లేడిని చూడుమా || 2 || 

        **నా మనోహర రామ చంద్రా....**
        ''')
    with st.expander("సర్వమంగళ నామా సీతా రామా రామా"):
        st.write('''
        సర్వమంగళ నామా సీతా రామా రామా 

        సర్వ వినుత శాంతి ధాతా రామా రామా 

        మనసులో నీ మాయ మాపి రామా రామా 

        మలుపుమా నీ మోము చూపి రామా రామా 

        నీవు నేనని బేద బుద్ది మాపి మాలో 

        నిలుపుమా నీ జ్ఞాన దీప్తి రామా రామా
        
        కామ క్రోధ లోభమోహ పాశమ్ము లా 

        కడకు తోసి కావు వయ్యా రామా రామా 

        ఏకశిలా పుర వాస సీతా రామా రామా 

        లోకేశా బహురూప విలాశా కొదండా రామా 

 

        రామకృష్ణ గోవింద నారాయణా 

        రామకృష్ణ గోవింద నారాయణా

        ప్రేమించి పాలించు నారాయణా 

        రామకృష్ణ గోవింద నారాయణా 

        రామకృష్ణ గోవింద నారాయణా 

        రామకృష్ణ గోవింద నారాయణా
        ''')
    with st.expander("నిను మది కొలిచెదరామా"):
        st.write('''
        **సాకి :-**

        దాశరథీ......కరుణా పయోనిధీ...... వినవా......

        మా మొర రఝవంవ రాఝవా...... సమ గమదనిస నిదమగసా

        **పల్లవి :-** 

        నిను మది కొలిచెద రామా.......

        మము కరుణించవె రామా...... 

        నినువినమనగలనా రామా... 

        నీ సరి యెవరు రామా.......

        **(నిను మది)**

 

        **చరణం:-**

        వరములందిచ రమ్మంటినా...

        పదవులందించి పొంమ్మంటినా... శ్రీ రామా...

        జయ రఝ రామా, ఘోర భవవార్జీ దాటించవయ్యా,

        **(నిను మది)**

 

        **చరణం:-** 

        కొలుచు వారళ కొలువుందువే...

        తలచు వారల దయగాంతువే శ్రీ రామా...

        జయ రఝ రామా, చలము చాలించి పాలించవయ్యా. 
        
        **(నిను మది)**

 
        శ్రీ రామా జయ రఝ రామా రామా...

        రామా... రామా...శ్రీ

        రామా జయ రఝ రామా"
        ''')
    with st.expander("మా ఇలవేలుపు నీవెనయ్య"):
        st.write('''
            ప|| మా ఇలవేలుపు నీవెనయ్య మముకాపాడే రామయ్య 

            **మా ఇలవేలుపు నీవెనయ్య మము కాపాడే రామయ్య** 

            చ అనుదినము నిను కొలిచెదము నీ శుభ నామమే పలికెదము 

            మా తోడు నీడై 

            మా ఇంటిసీరివై 

            మాతోడు నీడై 

            మాఇంటి సిరివై

            మమ్మేలుకోవయ్యా మముకాపడే రామయ్య 

            రాం రాం సీతా రాం 

            రాం రాం సీతారాం 

            రాం రాం సీతారాం 

            **మా ఇలావేలుపు నీవెనయ్య మముకాపడే రామయ్య** 

            చ అన్నదమ్ములకు ఆలు మగలకు ఆదర్శమూర్తులు మీరే 

            అన్నదమ్ములకు ఆలుమగలకు ఆదర్శమూర్తులు మీరే 

            సంసార జీవిత సౌభాగ్యమంత 

            సంసార జీవిత సౌభాగ్యమంత 

            నీ ఫలమేనయ్య 

            మముకాపడే రామయ్య 

            రాం రాం సీతారాం 

            రాం రాం సీతారాం 

            రాం రాం సీతారాం 

            రాం రాం సీతారాం 

            **మా ఇల వేలుపు నీవెనయ్య మముకాపడే రామయ్య మము కాపాడే రామయ్య**
        ''')
    with st.expander("పావన గుణ రామా హరే"):
        st.write('''
            **పావన గుణ రామా హరే - పావన గుణ రామా హరే**

            రామా హరే || పావన గుణ !!

            పరమ దయా నీలయా హరే - పరమ దయా నీలయా హరే

            **|| పావన గుణ ||**

            **చరణం 1:**

            మాయా మానుష రూపా - మాయాతీతా మంగళ దాలా 
            మాయా మానుష రూపా - మాయాతీతా మంగళ దాతా 
            వేదాంత వధూ హృదయ విహారా - వేదాంత వధూ హృదయ 
            విహారా వేదమయా పరమానంద రూపా - వేదమయా పరమానంద రూపా 

 
            **|| పావన గుణ !!!** 

            **చరణం 2:**

            కరుణారసభర నయనా - దరహాసమనోహర వదనా కరుణారసభర నయనా - దరహాస మనోహర వదనా నవతులసిదళ మాలాభరణా - నవతులసిదళ మాలాభరణా నానా జీవన నాటక కారణ - నానా జీవన నాటక కారణ 

            **|| పావన గుణ||**
        ''')
    with st.expander("దరిశనమీయవ దశరథరామ"):
        st.write('''
            రామ...

            రామ....దశరథ రామ.... రామ… 

            **పల్లవి:దరిశనమీయవ దశరథరామ మారుతి సేవిత సీతారామ**

            చ1)  

            పతిత పావన జానకి వినుత 

            అగణిత గుణధామ శ్రీరామ రామ 

            రవికుల మోహన రాజారామ 

            అల్పులపైన అలుకేలనయ్యా

            **"దరిశనమీయవ"**
            
            చ2)

            సత్యము ధర్మము నడపిన రాముడు 

            నిత్యము బ్రోవగ నిలచిన దేవుడు 

            పావననామ ఓ పరంధామ 

            మా మొరవినరా భవభయహరణ

            **"దరిశనమీయవ"**

            రాం జయరాం శ్రీరాం జయరాం
        ''')
    with st.expander("ఏ తీరుగ నను దయ చూచెదవో"):
        st.write('''
        **ఏ తీరుగ నను దయ చూచెదవో, ఇన వంశోత్తమ రామా** 

        ఏ తీరుగ నను దయ చూచెదవో, ఇన వంశోత్తమ రామా 

        నా తరమా భవ సాగరమీదను, నళిన దళేక్షణ రామా 
        
        నా తరమా భవ సాగరమీదను, నళిన దళేక్షణ రామా 
        
        శ్రీ రఘు నందన సీతా రమణా, శ్రితజన పోషక రామా 
        
        కారుణ్యాలయ భక్త వరద నిను, కన్నది కానుపు రామా 
        
        క్రూరకర్మములు నేరక చేసితి, నేరములెంచకు రామా 
        
        క్రూరకర్మములు నేరక చేసితి, నేరములెంచకు రామా
        
         దారిద్ర్యము పరిహారము సేయవే. దైవ శిఖామణి రామా
         
         **ఏ తీరుగ నను దయ చూచెదవో, ఇన వంశోత్తమ రామా** 
    ''')
    with st.expander("రామ రామ రామ యన్న రామచిలుక ధన్యము"):
        st.write('''
            రామ రామ రామ యన్న రామచిలుక ధన్యము 

            రామ ప్రేమ చూరగొన్న చిట్టి ఉడుత ధన్యము     2             
                        
            అభినందనలందుకున్న కోతిమూక ధన్యము 
            
            ఆశీస్సులు పొందిన ఆ పాక్షిరాజు ధన్యము 
            
            రామ. రామ శ్రీ రామ రామ జయ రామ రామ |  
             
            రేగిపండు తినిపించిన శబరి మాత ధన్యము 
            
            నావ నడిడిపి దరి చేర్చిన గుహుని జన్మ ధన్యము    2 
            
            రామ రామ శ్రీ రామ రామ జయ రామ రామ | 
            
            పాదధూళి సోకిన ఆశిల ఎంతో ధన్యము 
            
            వారధిని నిలిపిన ఆ జలమెంతో ధన్యము               2 
            
            రామ రామ శ్రీరామ రామ జయరామ రామ | 
        
            మధురాతి మధురము రొండక్షరాల మంత్రము 
            
            సత్యధర్మ శాంతియే రాముడి అవతారము               2 
            
            రామ రామ శ్రీరామ రామ జయరామ రామ రామ రామ 2 
        ''')
    with st.expander("వినుడు వినుడు రామాయణ గాథ వినుడీ మనసారా"):
        st.write('''
            ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ
            వినుడు వినుడు రామాయణ గాథ వినుడీ మనసారా
            వినుడు వినుడు రామాయణ గాథ వినుడీ మనసారా
            ఆలపించినా ఆలకించినా  ఆనంద మొలకించే గాథ
            
            **వినుడు వినుడు రామాయణ గాథ వినుడీ మనసారా**
            
            శ్రీ రాముని రారాజు సేయగా కోరెను దశరథ భూజాని
            పౌరులెల్ల ఉప్పొంగి పోయిరా మంగళ వార్తవిని
            
            ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ
            ఆ ఆ ఆఆ ఆ ఆఆ ఆ ఆఆ ఆ ఆ
            ఆ ఆ ఆఆ ఆ ఆఆ ఆ ఆఆ ఆ ఆఆ ఆ ఆఆ ఆ ఆఆ ఆ ఆఆ ఆ ఆఆ ఆ ఆఆ ఆ ఆ
            పౌరులెల్ల ఉప్పొంగి పోయిరా మంగళ వార్తవిని  
            కారు చిచ్చుగా మారెను కైక మందర మాటవిని...మందర మాటవిని
             
            **వినుడు వినుడు రామాయణ గాథ వినుడీ మనసారా**
            
            అలుక తెలిసి ఏతెంచిన భూపతి నడిగెను వరములు ఆ తన్వీ
            సలుప వలయు పట్టాభిషేకమూ భరతునికీ పృథివీ
            మెలగ వలయు పదునాలు గేడులు రాముడు కారడవీ
            చెలియ మాటకు ఔను కాదనీ పలుకడు భూజానీ
            కూలే భువిపైని....
            
            **వినుడు వినుడు రామాయణ గాథ వినుడీ మనసారా**
            
            కౌసలేయు రావించి మహీపతి ఆనతి తెలిపెను పిన తల్లీ
            మోస మెరిగి సౌమిత్రి కటారీ దూసెను రోసిల్లీ
            దోసమనీ వెనుదీసె తమ్మునీ రాముడు నయశాలి
            వనవాస దీక్షకు సెలవుకోరే పినతల్లి పదాల వ్రాలి
            
            ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ
            ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ  ఓ
            వెడలినాడు రాఘవుడు అడవికేగగా పడతి సీత సౌమిత్రి తోడునీడగా
            వెడలినాడు రాఘవుడు అడవికేగగా పడతి సీత సౌమిత్రి తోడునీడగా 
            ఘోడు ఘోడునా అయోధ్య గొల్లుమన్నదీ
            ఆ ఆ ఆఆ ఆ ఆఆ ఆ ఆఆ ఆ ఆ
            వీడకుమా.... మనలేమని వేడు కొన్నదీ
            ఆ ఆ ఆఆ ఆ ఆఆ ఆ ఆఆ ఆ ఆ
            అడుగులబడి రాఘవా..... అడుగులబడి రాఘవా..... ఆగమన్నదీ...ఆగమన్నదీ.... ఆగమన్నదీ....
            అడలి అడలి కన్నీరై అరయుచున్నదీ
        ''')
    with st.expander("అయోధ్య నగరం లో ఆ రామలక్ష్మణులు"):
        st.write('''
            పల్లవి... 

            అయోధ్య నగరం లో ఆ రామలక్ష్మణులు 
            
            అడవులకు పయనమాయిరి 
            
            ఆ రామలక్ష్మణులు మునివెంట బయలుదేరిరి. 
            
             
            
            1. తండ్రిని సెలవడిగి అయోధ్య నగరం విడిచి 
            
            అడవులకు పయనమాయిరి 
            
            ఆ రామలక్ష్మణులు అడవులకు బయలుదేరిరి 
            
             
            
            2. అదిగో చూడుమయ అందాలరామయ్య 
            
            తాటకిని హతమార్చవయా 
            
            ఓ రామయ్య తాటకిని హతమార్చవయా 
            
             
            
            3. బాణము చేతబట్టి విల్లును ఎక్కుబెట్టి 
            
            రాక్షసిని హతమార్చవయ 
            
            ఓ రామయ్య రాక్షసిని హతమార్చవయా 
            
             
            
            4. విశ్వామిత్రుని వెంట అడవిమార్గం గుండా 
            
            మిథులకుపయనమాయిరి 
            
            ఆ రామలక్ష్మణులు మిథులకు పయనమాయిరి 
            
             
            
            5.రాతిని నాతిగచేసి హరివిల్లును విరచి 
            
            సీతమ్మ ను పెండ్లాడెను 
            
            ఆ రామయ్య సీతమ్మను పెండ్లాడెను
        ''')
    with st.expander("శ్రీ సీతారాముల కళ్యాణం చూతము రారండి"):
        st.write('''
            సీతారాముల కళ్యాణం చూతమురారండి 

            శ్రీసీతారాముల కళ్యాణం చూతము రారండి 
            
            సిరికళ్యాణపు బొట్టును పెట్టి బొట్టును పెట్టి 
            
            మణి బాసికమును నుదుటను కట్టి నుదుటను కట్టి 
            
            పారాణిని పాదాలకు పెట్టి 
            
            ఆ ఆ ఆ ఆ ఆ ఆ ఆ ఆ 
            
            పారాణిని పాదాలకు పెట్టి 
            
            పెళ్ళికూతురై వెలసిన సీతా కళ్యాణం చూతము రారండి 
            
            **శ్రీ సీతారాముల కళ్యాణం చూతము రారండి**
            
            సంపగి నూనెను కురులను దువ్వి కురులను దువ్వి 
            
            సొంపుగ కస్తూరి నామము తీర్చి నామము తీర్చి 
            
            చెంపగవాకి చుక్కను పెట్టి 
            
            ఆ ఆ ఆ ఆ ఆ అఆ 
            
            చెంపగవాకి చుక్కను పెట్టి 
            
            పెళ్ళికొడుకై వెలిసిన రాముని కళ్యాణం చూతమురారండి 
            
            **శ్రీసీతారాముల కళ్యాణం చూతమురారండి**
            
            జానకి దోసిట కెంపుల ప్రోవై. కెంపుల ప్రోవై. 
            
            రాముని దోసిట నీలపురాశై నీలపురా , 
            
            ఆణిముత్యములు తలంబ్రాలుగా 
            
            ఆ ఆ ఆ అ అ ఆ ఆ 
            
            ఆణిముత్యములు తలంబ్రాలుగా 
            
            ఇరవుల మెరిసిన సీతారాముల కళ్యాణం చూతమురారండి 
            
            **శ్రీసీతారాముల కళ్యాణం చూతము రారండి**
        ''')
    with st.expander("శ్రీ రామ కళ్యాణమే వెన్నెలా"):
        st.write('''
            **శ్రీ రామ కళ్యాణమే వెన్నెలా** 

            సీతమ్మ వైభోగమే వెన్నెలా (2)
            
            అయోధ్య పురమున వెన్నెలో వెన్నెలా 
            
            దశరథ మహారాజంట వెన్నెలో వెన్నెలా 
            
            ఆ రాజుకు ముగ్గురు వెన్నెలో వెన్నెలా 
            
            రాణులే కలరంట వెన్నెలో వెన్నెలా 
            
            కౌసల్య సుమిత్ర వెన్నెల 
            
            కైకేయి చిన్న రాణి వెన్నెల వెన్నెలా
            
            **శ్రీ రామ కళ్యాణమే వెన్నెలా** 
            
            సీతమ్మ వైభోగమే వెన్నెలా 
            
            ఆ రాజుకు కొడుకులు వెన్నెల్లో వెన్నెలా 
            
            నలుగురు కలరంట వెన్నెల్లో వెన్నెలా 
            
            శ్రీరామ లక్ష్మణులు వెన్నెలో వెన్నెలా 
            
            భరత శత్రుఘ్నులంట వెన్నెలో వెన్నెలా 
            
            శ్రీ రామ చంద్రుడంట వెన్నెలా 
            
            గారాల కొడుకంట  వెన్నెల వెన్నెలా 
            
            **శ్రీ రామ కళ్యాణమే వెన్నెలా** 
            
            సీతమ్మ వైభోగమే వెన్నెలా 
            
            జనక మహారాజునకు వెన్నెలో వెన్నెలా 
            
            ఏకైక పుత్రికట వెన్నెల్లో వెన్నెలా 
            
            ఆ తల్లి పేరేమో వెన్నెల్లో వెన్నెలా 
            
            సీతమ్మ దేవియట వెన్నెలో వెన్నెలా 
            
            సీతమ్మకు రామయ్యకు వెన్నెలా 
            
            కళ్యాణం జరిగెనంట వెన్నెల వెన్నెలా             
            
            **శ్రీ రామ కళ్యాణమే వెన్నెలా** 
            
            సీతమ్మ వైభోగమే వెన్నెలా            
            
            ముత్యాల పందిట్లో వెన్నెల్లో వెన్నెలా 
            
            రతనాల తలంబ్రాలు వెన్నెలో వెన్నెలా 
            
            సీతారామ కళ్యాణం వెన్నెలో వెన్నెలా 
            
            లోక కళ్యాణమంట వెన్నెలో వెన్నెలా 
            
            కళ్యాణం చూచినచో వెన్నెలా 
            
            మన అందరి జన్మ ధన్యమంట వెన్నెల వెన్నెలా            
            
            **శ్రీ రామ కళ్యాణమే వెన్నెలా** 
            
            సీతమ్మ వైభోగమే వెన్నెలా
        ''')
    with st.expander("రామచంద్రాయ జనక రాజ"):
        st.write('''
            రామచంద్రాయ జనక రాజ జా మనోహరాయ 

            మామకాభీష్టదాయ… మహిత మంగళం
            
            రామచంద్రాయ జనక రాజజా మనోహరాయ 
            
            మామకాభీష్టదాయ… మహిత మంగళం 
            
            కోసలేశాయ మందహాస… దాస పోషణాయ 
            
            వాసవాది వినుత… సద్వరాయ మంగళం 
            
            చారు కుంకుమోపేత… చందనాని చర్చితాయ 
            
            హారకటక శోభితాయ… భూరి మంగళం 
            
            లలిత రత్నకుండలాయ… తులసీవనమాలికాయ 
            
            జలజ సదృశ దేహాయ చారు మంగళం 
            
            దేవకీ సుపుత్రాయ… దేవ దేవోత్తమాయ 
            
            బావజా గురువరాయ… భవ్య మంగళం 
            
            పుండరీకాక్షాయ పూర్ణచంద్రవదనాయ 
            
            అండజ వాహనాయ… అతుల మంగళం 
            
            విమలరూపాయ వివిధ… వేదాంత వేద్యాయ 
            
            సుముఖ చిత్త కామితాయ… శుభద మంగళం 
            
            రామదాసాయ మృదుల హృదయ… తామరస నివాసాయ
            
            స్వామి భద్రగిరివరాయ సర్వమంగళం 
            
            స్వామి భద్రగిరివరాయ సర్వమంగళం
        ''')
    with st.expander("నమ్మారా రాముని"):
        st.video("https://youtu.be/AqjPOzcSPz0?list=PLeoivk66vxxq_0eI8vfx91wZpwha8pMBl")
    with st.expander("శ్రీ రామ దూతం శిరసానమామి"):
        st.video("https://youtu.be/R4Cpi1ZxIXw?list=PLeoivk66vxxq_0eI8vfx91wZpwha8pMBl")
    with st.expander("రామ రామ యనరండి"):
        st.video("https://youtu.be/10kNLz3k4IU?list=PLeoivk66vxxq_0eI8vfx91wZpwha8pMBl")
    st.info("We are collecting more songs for you :) ")
with ramakoti_tab:
    st.info("Expected date to start this Japa is 25 December 2023.")